yii2/models/Category.php

    public function getCats() {
        $cats = Yii::$app->cache->get('cats');
        if(!$cats) {
            $cats = Category::find()->all();
---
SELECT * FROM `category`