yii2/models/Products.php

SELECT * FROM `products` ORDER BY `id` DESC LIMIT 10
---
    public function getLastTenProducts() {
        $products = Yii::$app->cache->get('tenProducts');
        if(!$products) {
            $products = Products::find()->orderBy(['id'=>SORT_DESC])->limit(10)->all();

SELECT * FROM `products` WHERE `id`='6'
---
    public function getOneProduct($id) {
        return Products::find()->where(['id'=>$id])->one();