yii2/models/Subscribe.php

SELECT * FROM `subscribe` WHERE `auth_key` IS NULL
---
    public function findAuth($auth) {
        return Subscribe::find()->where(['auth_key' => $auth])->one();