yii2/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'isValidated' => 1]);
---
SELECT * FROM `user` WHERE (`username`='admina') AND (`isValidated`=1)