yii2/controllers/CartController.php

INSERT INTO `order` (`name`, `email`, `address`, `phone`, `sum`) VALUES ('test', 'aprygin@mail.ru', '123', '123', 9000)
---
    public function actionSuccess() {
        $session = Yii::$app->session;
        $session->open();
        if ($session['cart.totalSum']) {
            $order = new Order();
            $order->name = $_POST['username'];
            $order->email = $_POST['email'];
            $order->address = $_POST['address'];
            $order->phone = $_POST['phone'];
            $order->sum = $session['cart.totalSum'];
            $order->save();

INSERT INTO `order_products` (`order_id`, `product_id`, `name`, `quantity`, `price`, `sum`) VALUES (22, 6, 'Кольцо 2', 5, 600, 3000)
---
    protected function saveOrderInfo($goods, $orderId) {

        foreach ($goods as $id=>$good) {
            $orderInfo = new OrderProducts();
            $orderInfo->order_id = $orderId;
            $orderInfo->product_id = $id;
            $orderInfo->name = $good['title'];
            $orderInfo->quantity = $good['quantity'];
            if (!Yii::$app->user->isGuest) {
                $orderInfo->price = $good['price']*0.9;
                $orderInfo->sum = $good['price']*0.9*$good['quantity'];
            } else {
                $orderInfo->price = $good['price'];
                $orderInfo->sum = $good['price']*$good['quantity'];
            }

            $orderInfo->save();